eaccount/app/Http/Controllers/AccountsReportController.php

select * from `branches` where `branches`.`id` = '2' and `branches`.`deleted_at` is null limit 1
select * from `income_expense_heads` where `income_expense_heads`.`id` = '1' and `income_expense_heads`.`deleted_at` is null limit 1
select * from `income_expense_heads` where `income_expense_heads`.`id` in (1) and `income_expense_heads`.`deleted_at` is null
select * from `transactions` where `transactions`.`branch_id` in (2) and `income_expense_head_id` = '1' and `voucher_date` between '2024-08-01' and '2024-09-30' and `transactions`.`deleted_at` is null
---
    public function ledger_branch_wise_report(Request $request)
    {
        $branch_module = '';
        $incomeExpenseHead = '';
        $now = new \DateTime();
        $date = $now->format(Config('settings.date_format') . ' h:i:s');
        $extra = array(
            'current_date_time' => $date,
            'module_name' => 'Branch Wise ledger Report',
            'voucher_type' => 'BRANCH WISE LEDGER REPORT'
        );
        $activ = Session::get('branch_array');
        $branch_id =$activ->id;

if($branch_id == 1){

    $branch_query = Branch::query();
}else{
    $branch_query = Branch::query();
	$branch_query->where('id',$branch_id);
}


        $branch_query->with('Transaction', 'Transaction.IncomeExpenseHead', 'Transaction.BankCash');
        if ($request->branch_id != null) {
            $branch_query->where('id', $request->branch_id);
            $branch_module = Branch::find($request->branch_id);
        }
        if ($request->income_expense_head_id != null) {
            $incomeExpenseHead = IncomeExpenseHead::find($request->income_expense_head_id);
        }
        $branch_query->with(['Transaction' => function ($query) use ($request) {
            if ($request->income_expense_head_id != null) {
                $query->where('income_expense_head_id', $request->income_expense_head_id);
            }
            if ($request->from != null && $request->to != null) {
                $query->whereBetween('voucher_date', array(date("Y-m-d", strtotime($request->from)), date("Y-m-d", strtotime($request->to))));
            }
        }]);

select * from `branches` where `id` = 2 and `id` = '2' and `branches`.`deleted_at` is null
---
        );
        //Show Action
        if ($request->action == 'Show') {
            return view('admin.accounts-report.ledger.branch-wise.index')
                ->with('items', $branch_query->get())
                ->with('extra', $extra)
                ->with('search_by', $search_by);
        }
        // Pdf Action
        if ($request->action == 'Pdf') {
            $pdf = PDF::loadView('admin.accounts-report.ledger.branch-wise.pdf', [
                'items' => $branch_query->get(),
                'extra' => $extra,
                'search_by' => $search_by,
            ])->setPaper('a4', 'landscape');

select * from `income_expense_heads` where `id` = '1' and `income_expense_heads`.`deleted_at` is null
select * from `branches` where `branches`.`id` = '2' and `branches`.`deleted_at` is null limit 1
select * from `income_expense_heads` where `income_expense_heads`.`id` = '1' and `income_expense_heads`.`deleted_at` is null limit 1
---
                $query->whereBetween('voucher_date', array(date("Y-m-d", strtotime($request->from)), date("Y-m-d", strtotime($request->to))));
            }
        }]);
        $search_by = array(
            'branch_name' => ($request->branch_id != null) ? Branch::find($request->branch_id)->name : '',
            'income_expense_head_name' => ($request->income_expense_head_id != null) ? IncomeExpenseHead::find($request->income_expense_head_id)->name : '',
            'from' => ($request->from) ? date(config('settings.date_format'), strtotime($request->from)) : '',
            'to' => ($request->to) ? date(config('settings.date_format'), strtotime($request->to)) : '',
        );