eaccount/app/Http/Controllers/BankCashController.php

    public function index()
    {
        \Artisan::call('cache:clear');

        $activ = Session::get('branch_array');
        $branch_id =$activ->id;
        $data = [];
if($branch_id == 1){

$items = DB::table('bank_cashes')
    ->select('bank_cashes.*', 'payment_mode.name as paymentname', 'payment_mode.id as payment_id')
    ->leftJoin('payment_mode', 'bank_cashes.payment_mode_id', '=', 'payment_mode.id')
    ->orderBy('bank_cashes.created_at', 'desc')
    ->paginate(60);




    $data['total_trashed_bank_cashes'] = $this->parentModel::onlyTrashed()->count();
---
select count(*) as aggregate from `bank_cashes` where `bank_cashes`.`deleted_at` is not null