eaccount/app/Http/Controllers/BranchController.php

select count(*) as aggregate from `branches` where `branches`.`deleted_at` is null
select count(*) as aggregate from `branches` where `branches`.`deleted_at` is not null
---
    public function index()
    {  \Artisan::call('cache:clear');
        $data = [];
        if (Cache::get('total_branches') && Cache::get('total_branches') != null) {
            $data['total_branches'] = Cache::get('total_branches');
        } else {
            $data['total_branches'] = $this->parentModel::count();
            Cache::put('total_branches', $data['total_branches']);
        }

        if (Cache::get('total_trashed_branches') && Cache::get('total_trashed_branches') != null) {
            $data['total_trashed_branches'] = Cache::get('total_trashed_branches');
        } else {
            $data['total_trashed_branches'] = $this->parentModel::onlyTrashed()->count();