eaccount/app/Http/Controllers/CrVoucherController.php

select * from `branches` where `branches`.`deleted_at` is null
select * from `branches` where `id` = 2 and `deleted_at` is null and `branches`.`deleted_at` is null
select `bank_cash` from `bank_cash_branches` where `branch_id` = 2
select * from `bank_cashes` where `id` in (1, 3, 7, 8, 9, 10, 10, 11, 12) and `bank_cashes`.`deleted_at` is null order by `created_at` desc
---
    public function __getBranchBankCashIncomeExpenseHead()
    {

        \Artisan::call('cache:clear');
        $activ = Session::get('branch_array');
        $branch_id =$activ->id;


        # code...
        $data = [];
        if (Cache::get('branches') && Cache::get('branches') != null) {
            $data['branches'] = Cache::get('branches');
        } else {
            if($branch_id == 1){
                $data['branches'] = Branch::all();
            }else{
                $data['branches'] = Branch::where('id',$branch_id)->where('deleted_at',Null)->get();
            }

            Cache::put('branches', $data['branches']);
        }
        if (Cache::get('bank_cashes') && Cache::get('bank_cashes') != null) {
            $branch_array = \DB::table('bank_cash_branches')->where('branch_id',$branch_id)->pluck('bank_cash')->toArray();
            $data['bank_cashes'] = BankCash::whereIn('id',$branch_array)->orderBy('created_at', 'desc')->get();
        } else {
            $branch_array = \DB::table('bank_cash_branches')->where('branch_id',$branch_id)->pluck('bank_cash')->toArray();
            $data['bank_cashes'] = BankCash::whereIn('id',$branch_array)->orderBy('created_at', 'desc')->get();

select * from `income_expense_heads` where `income_expense_heads`.`deleted_at` is null
select `ledger_id` from `ledger_branch` where `branch_id` = 2
select * from `income_expense_heads` where `id` in (1, 2, 3570, 3571, 3572, 3573, 3574, 3575, 3576, 3577, 3578, 3579, 3580, 3581, 3582, 3583, 3584, 3585) and `deleted_at` is null and `income_expense_heads`.`deleted_at` is null
---
        } else {

            if($branch_id == 1){
                $data['income_expense_heads'] = IncomeExpenseHead::all();
                Cache::put('income_expense_heads', $data['income_expense_heads']);
            }else{

                $checkaray = \DB::table('ledger_branch')->where('branch_id',$branch_id)->pluck('ledger_id')->toArray();


                $data['income_expense_heads'] = IncomeExpenseHead::whereIn('id',$checkaray)->where('deleted_at',Null)->get();