eaccount/app/Http/Controllers/DashboardController.php

    public function index()
    {
        \Artisan::call('cache:clear');
        $activ = Session::get('branch_array');
        $branch_id = $activ->id;
        $checkaray = \DB::table('ledger_branch')->where('branch_id',$branch_id)->pluck('ledger_id')->toArray();

        $data = array();
        if (Cache::get('total_branches') && Cache::get('total_branches') != null) {
            $data['total_branches'] = Cache::get('total_branches');
        } else {
            if($branch_id == 1){
                $data['total_branches'] = Branch::count();
                Cache::put('total_branches', $data['total_branches']);
            }else{
                $data['total_branches'] = Branch::where('id',$branch_id)->count();
                Cache::put('total_branches', $data['total_branches']);
            }

        }

        if (Cache::get('total_income_expense_types') && Cache::get('total_income_expense_types') != null) {
            $data['total_income_expense_types'] = Cache::get('total_income_expense_types');
        } else {
            $data['total_income_expense_types'] = IncomeExpenseType::count();
---
select `ledger_id` from `ledger_branch` where `branch_id` = 2
select count(*) as aggregate from `branches` where `branches`.`deleted_at` is null
select count(*) as aggregate from `branches` where `id` = 2 and `branches`.`deleted_at` is null
select count(*) as aggregate from `income_expense_types` where `income_expense_types`.`deleted_at` is null

        if (Cache::get('total_income_expense_groups') && Cache::get('total_income_expense_groups') != null) {
            $data['total_income_expense_groups'] = Cache::get('total_income_expense_groups');
        } else {
            $data['total_income_expense_groups'] = IncomeExpenseGroup::count();
---
select count(*) as aggregate from `income_expense_groups` where `income_expense_groups`.`deleted_at` is null

            $data['total_income_expense_heads'] = Cache::get('total_income_expense_heads');
        } else {
            if($branch_id == 1){
                $data['total_income_expense_heads'] = IncomeExpenseHead::count();
                Cache::put('total_income_expense_heads', $data['total_income_expense_heads']);
            }else{
                $data['total_income_expense_heads'] = IncomeExpenseHead::whereIn('id',$checkaray)->count();
---
select count(*) as aggregate from `income_expense_heads` where `income_expense_heads`.`deleted_at` is null
select count(*) as aggregate from `income_expense_heads` where `id` in (1, 2, 3570, 3571, 3572, 3573, 3574, 3575, 3576, 3577, 3578, 3579, 3580, 3581, 3582, 3583, 3584, 3585) and `income_expense_heads`.`deleted_at` is null

        if (Cache::get('total_bank_cashes') && Cache::get('total_bank_cashes') != null) {
            $data['total_bank_cashes'] = Cache::get('total_bank_cashes');
        } else {
            $data['total_bank_cashes'] = BankCash::count();
---
select count(*) as aggregate from `bank_cashes` where `bank_cashes`.`deleted_at` is null

        if (Cache::get('total_users') && Cache::get('total_users') != null) {
            $data['total_users'] = Cache::get('total_users');
        } else {
            $data['total_users'] = User::count();
---
select count(*) as aggregate from `users` where `users`.`deleted_at` is null

        if (Cache::get('total_role_manages') && Cache::get('total_role_manages') != null) {
            $data['total_role_manages'] = Cache::get('total_role_manages');
        } else {
            $data['total_role_manages'] = RoleManage::count();
---
select count(*) as aggregate from `role_manages` where `role_manages`.`deleted_at` is null

    public function graphTotalVoucher($year = null)
    {  \Artisan::call('cache:clear');
        # code...
        // dr voucher, cr voucher, cnt voucher & journal voucher
        $total_dr_voucher = [];
        $total_cr_voucher = [];
        $total_cnt_voucher = [];
        $total_jnl_voucher = [];
        if ($year == null) {
            $year = date('Y');
        }
        $transaction_query = Transaction::query();
        $transaction_query->whereYear('voucher_date', $year);
        $transactions = $transaction_query->get();
---
select * from `transactions` where year(`voucher_date`) = '2025' and `transactions`.`deleted_at` is null

    public function graphProfitLoss($year = null)
    {  \Artisan::call('cache:clear');
        // types
        $ledger_types = [102, 104, 114, 115, 105, 106, 116, 117];
        $types = IncomeExpenseType::whereIn('code', $ledger_types)->select('name', 'code')->get()->toArray();
        // transaction
        $transaction_query = Transaction::query();
        $transaction_query->whereHas('IncomeExpenseHead.IncomeExpenseType', function ($query) use ($ledger_types) {
            $query->whereIn('code', $ledger_types);
        });
        $transaction_query->with('IncomeExpenseHead', 'IncomeExpenseHead.IncomeExpenseType');
        $transaction_query->whereNotNull('income_expense_head_id');
        $transactions = $transaction_query->select(\DB::raw('CONCAT(YEAR(voucher_date), "-", MONTH(voucher_date))  AS month_date'), "id", 'income_expense_head_id', 'dr', 'cr')->get()->groupBy('IncomeExpenseHead.IncomeExpenseType.code');
---
select `name`, `code` from `income_expense_types` where `code` in (102, 104, 114, 115, 105, 106, 116, 117) and `income_expense_types`.`deleted_at` is null
select * from `income_expense_heads` where `income_expense_heads`.`id` in (1, 3578, 3579, 3581, 3582, 3585) and `income_expense_heads`.`deleted_at` is null
select * from `income_expense_types` where `income_expense_types`.`id` in (5, 6, 15, 16) and `income_expense_types`.`deleted_at` is null
select CONCAT(YEAR(voucher_date), "-", MONTH(voucher_date))  AS month_date, `id`, `income_expense_head_id`, `dr`, `cr` from `transactions` where exists (select * from `income_expense_heads` where `transactions`.`income_expense_head_id` = `income_expense_heads`.`id` and exists (select * from `income_expense_types` where `income_expense_heads`.`income_expense_type_id` = `income_expense_types`.`id` and `code` in (102, 104, 114, 115, 105, 106, 116, 117) and `income_expense_types`.`deleted_at` is null) and `income_expense_heads`.`deleted_at` is null) and `income_expense_head_id` is not null and `transactions`.`deleted_at` is null