eaccount/app/Http/Controllers/IncomeExpenseHeadController.php

select * from `income_expense_groups` where `income_expense_groups`.`deleted_at` is null
select * from `income_expense_types` where `income_expense_types`.`deleted_at` is null
---
    public function __get_cache_data()
    { \Artisan::call('cache:clear');
        # code...
        $data = [];
        if (Cache::get('income_expense_groups') && Cache::get('income_expense_groups') != null) {
            $data['income_expense_groups'] = Cache::get('income_expense_groups');
        } else {
            $data['income_expense_groups'] = IncomeExpenseGroup::all();
            Cache::put('income_expense_groups', $data['income_expense_groups']);
        }
        if (Cache::get('income_expense_types') && Cache::get('income_expense_types') != null) {
            $data['income_expense_types'] = Cache::get('income_expense_types');
        } else {
            $data['income_expense_types'] = IncomeExpenseType::all();