eaccount/app/Http/Controllers/IncomeExpenseGroupController.php

select count(*) as aggregate from `income_expense_groups` where `income_expense_groups`.`deleted_at` is null
select count(*) as aggregate from `income_expense_groups` where `income_expense_groups`.`deleted_at` is not null
---
    public function index()
    { \Artisan::call('cache:clear');
        $data = [];
        if (Cache::get('total_income_expense_groups') && Cache::get('total_income_expense_groups') != null) {
            $data['total_income_expense_groups'] = Cache::get('total_income_expense_groups');
        } else {
            $data['total_income_expense_groups'] = $this->parentModel::count();
            Cache::put('total_income_expense_groups', $data['total_income_expense_groups']);
        }
        if (Cache::get('total_trashed_income_expense_group') && Cache::get('total_trashed_income_expense_group') != null) {
            $data['total_trashed_income_expense_group'] = Cache::get('total_trashed_income_expense_group');
        } else {
            $data['total_trashed_income_expense_group'] = $this->parentModel::onlyTrashed()->count();

select * from `income_expense_types` order by `id` desc
---
    public function create()
    { \Artisan::call('cache:clear');
        $group = \DB::table('income_expense_types')->orderby('id','desc')->get();

select * from `income_expense_heads` where `income_expense_heads`.`income_expense_group_id` = 30 and `income_expense_heads`.`income_expense_group_id` is not null and `income_expense_heads`.`deleted_at` is null
---
    public function destroy($id)
    { \Artisan::call('cache:clear');
        $items = $this->parentModel::find($id);
        if (empty($items)) {
            Session::flash('error', "Item not found");
            return redirect()->back();
        }
        if (count($this->parentModel::find($id)->IncomeExpenseHeads) > 0) {  // Child has or not

insert into `income_expense_subgroups` (`name`, `relation_id`, `group_id`, `created_by`) values ('Test Sub Group', '29', 0, 'admin@enrichapp.co.in')
---
    public function savesubgroup0(Request $request)
    {
        \Artisan::call('cache:clear');
      $ins =  array(
            'name' => $request->person,
             'relation_id' => $request->data,
             'group_id' => 0,
            'created_by' => auth()->user()->email,
        );
        \DB::table('income_expense_subgroups')->insert($ins);