eaccount/app/Http/Controllers/LanguageController.php

select * from `income_expense_groups` where `deleted_at` is null order by `created_at` desc
select `ledger_id` from `ledger_branch` where `branch_id` = 2
select * from `income_expense_heads` where `type` = 1 and `id` in (1, 2, 3570, 3571, 3572, 3573, 3574, 3575, 3576, 3577, 3578, 3579, 3580, 3581, 3582, 3583, 3584, 3585) and `deleted_at` is null order by `created_at` desc
select * from `income_expense_heads` where `type` = 1 and `deleted_at` is null order by `created_at` desc
select * from `staff` where `expense_create` = 1
select * from `staff` where `expense_approve` = 1
---
    public function bill_recieved(Request $request)
    {
        \Artisan::call('cache:clear');
        $data = [];



        $data['head'] = \DB::table('income_expense_groups')->where('deleted_at',NULL)->orderBy('created_at', 'desc')->get();


        $activ = Session::get('branch_array');
        $branch_id =$activ->id;
        $checkaray = \DB::table('ledger_branch')->where('branch_id',$branch_id)->pluck('ledger_id')->toArray();



         if($branch_id != 1){
            $ledger = \DB::table('income_expense_heads')->where('type',1)->whereIn('id',$checkaray)->where('deleted_at',Null)->orderBy('created_at', 'desc')->get();

         }else{
            $ledger = \DB::table('income_expense_heads')->where('type',1)->where('deleted_at',Null)->orderBy('created_at', 'desc')->get();

         }

        if($branch_id == 2){
        $expense_paid =\DB::connection('second_db')->table('staff')->where('expense_create',1)->get();
        $expense_approve =\DB::connection('second_db')->table('staff')->where('expense_approve',1)->get();

select * from `income_expense_subgroups` where `group_id` = 0 and `relation_id` is null order by `created_at` desc
---
    public function bill_recievedsubfilter(Request $request)
    {

        \Artisan::call('cache:clear');
      $group =  $request->val;

      $items = \DB::table('income_expense_subgroups')->where('group_id',0)->where('relation_id',$group)->orderBy('created_at', 'desc')->get();

select `bank_cash` from `bank_cash_branches` where `branch_id` = 2
select * from `bank_cashes` where `id` in (1, 3, 7, 8, 9, 10, 10, 11, 12)
select * from `staff` where `expense_create` = 1
select * from `staff` where `expense_approve` = 1
select * from `staff` where `expense_paid` = 1
---
    public function bill_recieved_list(Request $request)
    { \Artisan::call('cache:clear');

        $data = [];
        $activ = Session::get('branch_array');
        $branch_id =$activ->id;

        $date=  $request->from;
        $billno=  trim($request->billno);
        $voucherno=  trim($request->voucherno);
        $a=  trim($request->submitted_by);
        $b=  trim($request->expense_approve);
        $c=  trim($request->paid_by);





            $bankcashbranches =\DB::table('bank_cash_branches')->where('branch_id',$branch_id)->pluck('bank_cash')->toArray();

            $bankcash =\DB::table('bank_cashes')->whereIn('id',$bankcashbranches)->get();



            if($branch_id == 2){
                $expense_create =\DB::connection('second_db')->table('staff')->where('expense_create',1)->get();
                $expense_approve =\DB::connection('second_db')->table('staff')->where('expense_approve',1)->get();

                $expense_paid =\DB::connection('second_db')->table('staff')->where('expense_paid',1)->get();

insert into `bill_received_payment` (`exp_id`, `amount`, `payment_mode`, `payment_details`, `account`, `paid_by`, `payment_date`, `voucher_no`, `created_by`, `created_at`) values ('15', '174937', 'Cheque', 'cheque no. 062038', '1', '32', '2024-04-03', '07', 'admin@enrichapp.co.in', '2025-03-27 16:21:19')
---
      'created_at'  => date('Y-m-d H:i:s'),);


      \DB::table('bill_received_payment')->insert($data);

select * from `expense` where `id` = '15' limit 1
---



       $details =  \DB::table('expense')->where('id',$request->exp_id)->first();

insert into `transactions` (`branch_id`, `bank_cash_id`, `income_expense_head_id`, `dr`, `voucher_type`, `voucher_date`, `voucher_no`, `created_by`, `created_at`) values (2, '1', 3583, '174937', 'DV', '2024-04-03', '07', 'admin@enrichapp.co.in', '2025-03-27 16:21:19')
---
        'created_at' =>date('Y-m-d H:i:s'),
      );

      \DB::table('transactions')->insert($tobeinserted);

select `ledger_id` from `ledger_branch` where `branch_id` = 2
select * from `bill_received_payment` where `exp_id` = '15'
---
    public function viewbillpayments(Request $request)
    { \Artisan::call('cache:clear');
      $val =  $request->val;


$activ = Session::get('branch_array');
$branch_id =$activ->id;
$checkaray = \DB::table('ledger_branch')->where('branch_id',$branch_id)->pluck('ledger_id')->toArray();




$loops =\DB::table('bill_received_payment')->where('exp_id',$val)->get();

select `name` from `bank_cashes` where `id` = 1 limit 1
---
$a .='<td>'.$lop->payment_mode.'</td>';
$a .='<td>'.$lop->payment_details??'NA'.'</td>';

$bankcash =\DB::table('bank_cashes')->where('id',$lop->account)->value('name');

select * from `staff` where `id` = 32 limit 1
---


if($branch_id == 2){
    $expense_paid =\DB::connection('second_db')->table('staff')->where('id',$lop->paid_by)->first();

select `ledger_id` from `ledger_branch` where `branch_id` = 2
select * from `income_expense_heads` where `type` = 1 and `id` in (1, 2, 3570, 3571, 3572, 3573, 3574, 3575, 3576, 3577, 3578, 3579, 3580, 3581, 3582, 3583, 3584, 3585) and `deleted_at` is null and `income_expense_group_id` is null order by `created_at` desc
---
    public function bill_recievedledger(Request $request)
    { \Artisan::call('cache:clear');
        $activ = Session::get('branch_array');
        $branch_id =$activ->id;

      $group =  $request->val;


      $checkaray = \DB::table('ledger_branch')->where('branch_id',$branch_id)->pluck('ledger_id')->toArray();

      $ledger = \DB::table('income_expense_heads')->where('type',1)->whereIn('id',$checkaray)->where('deleted_at',Null)->where('income_expense_group_id',$group)->orderBy('created_at', 'desc')->get();

select * from `income_expense_types` where `deleted_at` is null
select * from `income_expense_groups` where `deleted_at` is null
select `session_budget`.*, `income_expense_groups`.`name` as `namm`, `income_expense_types`.`name` from `session_budget` inner join `income_expense_groups` on `income_expense_groups`.`id` = `session_budget`.`ledger_group` inner join `income_expense_types` on `income_expense_types`.`id` = `session_budget`.`ledger_type` order by `session_budget`.`created_at` desc limit 15 offset 0
select count(*) as aggregate from `session_budget` inner join `income_expense_groups` on `income_expense_groups`.`id` = `session_budget`.`ledger_group` inner join `income_expense_types` on `income_expense_types`.`id` = `session_budget`.`ledger_type`
---
    public function session_budget()
    {

        $data = [];
        $data['sessions'] =\DB::connection('second_db')->table('sessions')->get();
        $data['types'] =\DB::table('income_expense_types')->where('deleted_at',NULL)->get();

        $data['groups'] =\DB::table('income_expense_groups')->where('deleted_at',NULL)->get();

  $list =  \DB::table('session_budget')->select(['session_budget.*','income_expense_groups.name as namm','income_expense_types.name'])
        ->join('income_expense_groups', 'income_expense_groups.id', '=', 'session_budget.ledger_group')
        ->join('income_expense_types', 'income_expense_types.id', '=', 'session_budget.ledger_type')
        //  ->get(['session_budget.*','income_expense_groups.name','income_expense_types.name']);
         ->orderBy('session_budget.created_at', 'desc')->paginate(15)->onEachSide(1);

select * from `income_expense_types` where `deleted_at` is null
select * from `income_expense_groups` where `deleted_at` is null
select * from `session_budget` where `id` = '16' limit 1
---
    public function editsession($id)
    {

        $data = [];
        $data['sessions'] =\DB::connection('second_db')->table('sessions')->get();
        $data['types'] =\DB::table('income_expense_types')->where('deleted_at',NULL)->get();

        $data['groups'] =\DB::table('income_expense_groups')->where('deleted_at',NULL)->get();


      $edit = \DB::table('session_budget')->where('id',$id)->first();

delete from `session_budget` where `session_budget`.`id` = '14'
---
    public function deletesession($id)
    {
        \Artisan::call('cache:clear');

        \DB::table('session_budget')->where('session_budget.id',$id)->delete();

select `transactions`.*, `income_expense_heads`.`income_expense_group_id` as `group_id` from `transactions` left join `income_expense_heads` on `income_expense_heads`.`id` = `transactions`.`income_expense_head_id` where `transactions`.`branch_id` is null and `transactions`.`voucher_date` >= '1970-01-01' and `transactions`.`voucher_date` <= '1970-01-01' and `transactions`.`deleted_at` is null
---
        $data['end_datee'] = $end_datee ;


        $data['transactions'] =\DB::table('transactions')->select(['transactions.*','income_expense_heads.income_expense_group_id as group_id'])
        ->join('income_expense_heads', 'income_expense_heads.id', '=', 'transactions.income_expense_head_id','left')
        ->where('transactions.branch_id',$branch_id)
        ->where('transactions.voucher_date', '>=', $start_date)->where('transactions.voucher_date', '<=', $end_date)
        ->where('transactions.deleted_at',NULL)->get();

select `transactions`.*, `income_expense_heads`.`income_expense_group_id` as `group_id` from `transactions` left join `income_expense_heads` on `income_expense_heads`.`id` = `transactions`.`income_expense_head_id` where `transactions`.`branch_id` is null and `transactions`.`voucher_date` >= '' and `transactions`.`voucher_date` <= '' and `transactions`.`deleted_at` is null
---
        }


        $data['prevtransactions'] =\DB::table('transactions')->select(['transactions.*','income_expense_heads.income_expense_group_id as group_id'])
        ->join('income_expense_heads', 'income_expense_heads.id', '=', 'transactions.income_expense_head_id','left')
        ->where('transactions.branch_id',$branch_id)
        ->where('transactions.voucher_date', '>=', $prevstart_date)->where('transactions.voucher_date', '<=', $prevend_date)
        ->where('transactions.deleted_at',NULL)->get();

select `transactions`.*, `income_expense_heads`.`income_expense_group_id` as `group_id` from `transactions` left join `income_expense_heads` on `income_expense_heads`.`id` = `transactions`.`income_expense_head_id` where `transactions`.`branch_id` is null and `transactions`.`voucher_date` >= '' and `transactions`.`voucher_date` <= '' and `transactions`.`deleted_at` is null
---
        }


        $data['nexttransactions'] =\DB::table('transactions')->select(['transactions.*','income_expense_heads.income_expense_group_id as group_id'])
        ->join('income_expense_heads', 'income_expense_heads.id', '=', 'transactions.income_expense_head_id','left')
        ->where('transactions.branch_id',$branch_id)
        ->where('transactions.voucher_date', '>=', $nextstart_date)->where('transactions.voucher_date', '<=', $nextend_date)
        ->where('transactions.deleted_at',NULL)->get();

select * from `branches` where `id` is null limit 1
---
        // print_r($data['transactions']);die;


  $data['branch'] =\DB::table('branches')->where('id',$branch_id)->first();

select * from `income_expense_types`
---
         ->orderBy('income_expense_types.id', 'desc')->get();


         $array = \DB::table('income_expense_types')->get();