eaccount/app/Http/Controllers/TransactionController.php

    public function getUniqueBranches($branch_id)
    { \Artisan::call('cache:clear');
        if ($branch_id > 0) {
            $transaction_unique_branches = DB::table('transaction_branch_view')
                ->where('branch_id', $branch_id)
                ->get();
---
select * from `transaction_branch_view` where `branch_id` = 2