eaccount/app/Http/Controllers/Reports/Accounts/FixedAssetScheduleController.php

    public function getFixedAssetSchedule($branch_id, $from, $to)
    {\Artisan::call('cache:clear');

        // Get Fixed Asset Schedule Starting date from global varibable setting system
        $FixedAssetScheduleStartingDate = date('Y-m-d', strtotime(config('settings.fixed_asset_schedule_starting_date')));

        // Property, Plant & Equipment Code 119
        $TransactionsModel = new Transaction();
        $TransactionsController = new TransactionController();
        $uniqueBranches = $TransactionsController->getUniqueBranches($branch_id);
        $CostOfRevenueHeadTypes = IncomeExpenseType::whereIn('code', array(119))
            ->orderBy('code', 'asc')
            ->get();
---
select * from `income_expense_types` where `code` in (119) and `income_expense_types`.`deleted_at` is null order by `code` asc