eaccount/app/Http/Controllers/Reports/Accounts/TrialBalanceController.php

select * from `bank_cashes` where `bank_cashes`.`id` in (1, 11, 12) and `bank_cashes`.`deleted_at` is null
select * from `branches` where `branches`.`id` in (2) and `branches`.`deleted_at` is null
select * from `income_expense_heads` where `income_expense_heads`.`id` in (1, 3578, 3579, 3580, 3581, 3582, 3585) and `income_expense_heads`.`deleted_at` is null
---
            $transaction_query->whereBetween('voucher_date', [date("Y-m-d", strtotime($request->from)), date("Y-m-d", strtotime($request->to))]);
        }
        $transaction_query->with('Branch', 'IncomeExpenseHead', 'BankCash');
        $transactions = $transaction_query->orderBy('voucher_date', 'DESC')->get();