eaccount/app/Transaction.php

    public function getBalanceByIncExpHeadTypeIdBranchesTwoDate($IncomeExpenseTypeId, $transaction_unique_branches, $start_from, $start_to, $end_from, $end_to)
    {
        $IncomeExpenseHeads = IncomeExpenseType::find($IncomeExpenseTypeId)->IncomeExpenseHeads;
---
select * from `income_expense_heads` where `income_expense_heads`.`income_expense_type_id` = 19 and `income_expense_heads`.`income_expense_type_id` is not null and `income_expense_heads`.`deleted_at` is null
select * from `income_expense_types` where `income_expense_types`.`id` = 19 and `income_expense_types`.`deleted_at` is null limit 1