eaccount/app/Helpers/Helper.php

select `name`, `code` from `income_expense_types` where `code` in (108, 113, 109, 107, 110, 112, 111, 120, 103, 101, 121) and `income_expense_types`.`deleted_at` is null
select * from `income_expense_heads` where `income_expense_heads`.`id` in (1, 3578, 3579, 3582, 3585) and `income_expense_heads`.`deleted_at` is null
select * from `income_expense_types` where `income_expense_types`.`id` in (5, 15, 16) and `income_expense_types`.`deleted_at` is null
select * from `transactions` where `branch_id` = 2 and `voucher_date` between '2025-03-01' and '2025-03-01' and exists (select * from `income_expense_heads` where `transactions`.`income_expense_head_id` = `income_expense_heads`.`id` and exists (select * from `income_expense_types` where `income_expense_heads`.`income_expense_type_id` = `income_expense_types`.`id` and `code` in (108, 113, 109, 107, 110, 112, 111, 120, 103, 101, 121) and `income_expense_types`.`deleted_at` is null) and `income_expense_heads`.`deleted_at` is null) and `transactions`.`deleted_at` is null
---
    public static function totalAmountByLedgerType(array $ledger_type, $branch_id = null, $date_from = null, $date_to = null)
    {
        // types
        $types = IncomeExpenseType::whereIn('code', $ledger_type)->select('name', 'code')->get()->toArray();
        // transaction
        $transaction_query = Transaction::query();
        if ($branch_id) {
            $transaction_query->where('branch_id', $branch_id);
        }
        if ($date_from && $date_to) {
            $transaction_query->whereBetween('voucher_date', [date("Y-m-d", strtotime($date_from)), date("Y-m-d", strtotime($date_to))]);
        }
        $transaction_query->whereHas('IncomeExpenseHead.IncomeExpenseType', function ($query) use ($ledger_type) {
            $query->whereIn('code', $ledger_type);
        });
        $transaction_query->with('IncomeExpenseHead', 'IncomeExpenseHead.IncomeExpenseType');
        $transactions = $transaction_query->get()->groupBy('IncomeExpenseHead.IncomeExpenseType.code');

select * from `branches` where `id` = 2 and `deleted_at` is null and `branches`.`deleted_at` is null
select `bank_cash` from `bank_cash_branches` where `branch_id` = 2
select * from `bank_cashes` where `id` in (1, 3, 7, 8, 9, 10, 10, 11, 12) and `bank_cashes`.`deleted_at` is null order by `created_at` desc
select * from `income_expense_heads` where 0 = 1 and `deleted_at` is null and `income_expense_heads`.`deleted_at` is null
select `ledger_id` from `ledger_branch` where `branch_id` = 2
select * from `income_expense_heads` where `id` in (1, 2, 3570, 3571, 3572, 3573, 3574, 3575, 3576, 3577, 3578, 3579, 3580, 3581, 3582, 3583, 3584, 3585) and `deleted_at` is null and `income_expense_heads`.`deleted_at` is null
---
    public static function __getBranchBankCashIncomeExpenseHead()
    {

        $activ = Session::get('branch_array');
        $branch_id =$activ->id;
        # code...
        $data = [];
        if (Cache::get('branches') && Cache::get('branches') != null) {
            $data['branches'] = Cache::get('branches');
        } else {
            $data['branches'] = Branch::where('id',$branch_id)->where('deleted_at',Null)->get();
            Cache::put('branches', $data['branches']);
        }
        if (Cache::get('bank_cashes') && Cache::get('bank_cashes') != null) {
            $data['bank_cashes'] = Cache::get('bank_cashes');
        } else {
				$branch_array = \DB::table('bank_cash_branches')->where('branch_id',$branch_id)->pluck('bank_cash')->toArray();
            $data['bank_cashes'] = BankCash::whereIn('id',$branch_array)->orderBy('created_at', 'desc')->get();

            Cache::put('bank_cashes', $data['bank_cashes']);
        }
        if (Cache::get('income_expense_heads') && Cache::get('income_expense_heads') != null) {
            $data['income_expense_heads'] = Cache::get('income_expense_heads');
        } else {
            $checkaray = \DB::table('ledger_branch')->where('branch_id',$branch_id)->pluck('ledger_id')->toArray();
            $data['income_expense_heads'] = IncomeExpenseHead::whereIn('id',$checkaray)->where('deleted_at',Null)->get();

select * from `income_expense_types` where `income_expense_types`.`deleted_at` is null
---
        if (Cache::get('income_expense_types') && Cache::get('income_expense_types') != null) {
            $data['income_expense_types'] = Cache::get('income_expense_types');
        } else {
            $data['income_expense_types'] = IncomeExpenseType::all();

select * from `income_expense_groups` where `income_expense_groups`.`deleted_at` is null
---
        if (Cache::get('income_expense_groups') && Cache::get('income_expense_groups') != null) {
            $data['income_expense_groups'] = Cache::get('income_expense_groups');
        } else {
            $data['income_expense_groups'] = IncomeExpenseGroup::all();

select * from `bank_cashes` where `id` = '1' and `bank_cashes`.`deleted_at` is null
select * from `branches` where `branches`.`id` in (2) and `branches`.`deleted_at` is null
select * from `transactions` where `transactions`.`bank_cash_id` in (1) and `branch_id` = 2 and `transactions`.`deleted_at` is null
---
    public static function __bank_cash_details($bank_cash_id = null, $branch_id = null, $from = null, $to = null)
    {
        # code...
        $bank_cache_query = BankCash::query();
        $bank_cache_query->with('Transactions', 'Transactions.Branch');
        if ($bank_cash_id && $bank_cash_id != null) {
            $bank_cache_query->where('id', $bank_cash_id);
        }
        $params = [
            'branch_id' => $branch_id,
            'from' => $from,
            'to' => $to,
        ];
        $bank_cache_query->with(['Transactions' => function ($query) use ($params) {
            if ($params['branch_id'] && $params['branch_id'] != null) {
                $query->where('branch_id', $params['branch_id']);
            }
            if ($params['from'] && $params['from'] != null && $params['to'] && $params['to'] != null) {
                $query->whereBetween('voucher_date', array(date("Y-m-d", strtotime($params['from'])), date("Y-m-d", strtotime($params['to']))));
            }
        }]);
        return $bank_cache_query->get();

select * from `transactions` where `branch_id` = 2 and `voucher_date` between '2025-03-01' and '2025-03-01' and `transactions`.`deleted_at` is null order by `voucher_date` desc
---
    public static function __bank_cache_balance($bank_cash_id = null, $branch_id = null, $from = null, $to = null)
    {
        # code...
        $transaction_query = Transaction::query();
        if ($branch_id) {
            $transaction_query->where('branch_id', $branch_id);
        }
        if ($from && $to) {
            $transaction_query->whereBetween('voucher_date', [date("Y-m-d", strtotime($from)), date("Y-m-d", strtotime($to))]);
        }
        $transaction_query->with('Branch', 'IncomeExpenseHead', 'BankCash');
        $transactions = $transaction_query->orderBy('voucher_date', 'DESC')->get();

select * from `income_expense_heads` where `income_expense_heads`.`id` in (1, 2, 3578, 3579, 3580, 3581, 3582, 3585) and `income_expense_heads`.`deleted_at` is null
select * from `income_expense_types` where `income_expense_types`.`id` in (5, 6, 15, 16, 21) and `income_expense_types`.`deleted_at` is null
select * from `transactions` where `income_expense_head_id` is not null and `branch_id` = 2 and `voucher_date` between '2024-08-01' and '2025-02-28' and exists (select * from `income_expense_heads` where `transactions`.`income_expense_head_id` = `income_expense_heads`.`id` and exists (select * from `income_expense_types` where `income_expense_heads`.`income_expense_type_id` = `income_expense_types`.`id` and `income_expense_types`.`deleted_at` is null) and `income_expense_heads`.`deleted_at` is null) and `transactions`.`deleted_at` is null
---
    public static function type_wise_transaction_details($types_id = null, $branch_id = null, $from = null, $to = null)
    {
        # code...
        $transaction_query = Transaction::query();
        $transaction_query->with('IncomeExpenseHead', 'IncomeExpenseHead.IncomeExpenseType');
        $transaction_query->whereNotNull('income_expense_head_id');
        if ($branch_id) {
            $transaction_query->where('branch_id',  $branch_id);
        }
        if ($from && $to) {
            $transaction_query->whereBetween('voucher_date', [date("Y-m-d", strtotime($from)), date("Y-m-d", strtotime($to))]);
        }
        $transaction_query->whereHas('IncomeExpenseHead.IncomeExpenseType', function ($query) use ($types_id) {
            if ($types_id) {
                return $query->where('id', '=', $types_id);
            }
        });
        return $transaction_query->get()->groupBy('IncomeExpenseHead.IncomeExpenseType.name');

select * from `income_expense_groups` where `income_expense_groups`.`id` in (1, 19, 22, 24, 27, 29) and `income_expense_groups`.`deleted_at` is null
select * from `income_expense_heads` where `income_expense_heads`.`id` in (1, 2, 3578, 3579, 3580, 3581, 3582, 3585) and `income_expense_heads`.`deleted_at` is null
select * from `transactions` where `income_expense_head_id` is not null and `branch_id` = 2 and exists (select * from `income_expense_heads` where `transactions`.`income_expense_head_id` = `income_expense_heads`.`id` and exists (select * from `income_expense_groups` where `income_expense_heads`.`income_expense_group_id` = `income_expense_groups`.`id` and `income_expense_groups`.`deleted_at` is null) and `income_expense_heads`.`deleted_at` is null) and `transactions`.`deleted_at` is null
---
    public static function group_wise_transaction_details($group_id = null, $branch_id = null, $from = null, $to = null)
    {
        # code...
        $transaction_query = Transaction::query();
        $transaction_query->with('IncomeExpenseHead', 'IncomeExpenseHead.IncomeExpenseGroup');
        $transaction_query->whereNotNull('income_expense_head_id');
        if ($branch_id) {
            $transaction_query->where('branch_id',  $branch_id);
        }
        if ($from && $to) {
            $transaction_query->whereBetween('voucher_date', [date("Y-m-d", strtotime($from)), date("Y-m-d", strtotime($to))]);
        }
        $transaction_query->whereHas('IncomeExpenseHead.IncomeExpenseGroup', function ($query) use ($group_id) {
            if ($group_id) {
                return $query->where('id', '=', $group_id);
            }
        });
        return $transaction_query->get()->groupBy('IncomeExpenseHead.IncomeExpenseGroup.name');